# AreItemFilesLoaded Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..AreItemFilesLoaded Method
FabricationConfiguration Class See Also
---
Checks if the fabrication item files have been loaded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool AreItemFilesLoaded(
	IList<FabricationItemFile> itemFiles
)
```

Visual Basic
---
```text
Public Function AreItemFilesLoaded ( _
	itemFiles As IList(Of FabricationItemFile) _
) As Boolean
```

Visual C++
---
```text
public:
bool AreItemFilesLoaded(
	IList<FabricationItemFile^>^ itemFiles
)
```

# ### Parameters
itemFiles
    Type: System.Collections.Generic..::..IList<(Of <(<'FabricationItemFile>)>)> The fabrication item files.
# ### Return Value
Returns true if the fabrication item files have been loaded, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace